/******************************************************************************

                  版权所有 (C), 2001-2013, 北京加维通讯电子技术有限公司

 ******************************************************************************
  文 件 名   : native_download.h
  版 本 号   : 初稿
  作    者   : dwzhang
  生成日期   : 2013年5月22日
  最近修改   :
  功能描述   : native_download.cpp 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2013年5月22日
    作    者   : dwzhang
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#ifndef __NATIVE_DOWNLOAD_H__
#define __NATIVE_DOWNLOAD_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

extern JNIEXPORT jint JNICALL Java_com_pbi_dvb_dvbinterface_NativeDownload_downloadStart
  (JNIEnv *env, jobject obj);

extern JNIEXPORT jint JNICALL Java_com_pbi_dvb_dvbinterface_NativeDownload_downloadGetStatus
(JNIEnv *env, jobject obj);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __NATIVE_DOWNLOAD_H__ */

